
#language: ru
  Функционал: Покупка товаров
    Сценарий: Проверка покупки айфонов
    * Поиск "iphone"
    * Ограничиваем цену до "60000"
    * Выбрать чекбокс "Высокий рейтинг"
    * Выбрать чекбокс "3 ГБ"
    * Добавляем в корзину первые "8" "нечетных" товаров
    * Переходим в корзину
    * Проверяем наличие товаров в соответствии с запомненным
    * Проверяем отображение текста Ваша корзина - "6" товаров
    * Удаляем все товары из корзины
    * Проверяем, что "Корзина пуста"
    * Добавляем шаг, в котором будет приложен файл с информацией

  Сценарий: Проверка покупки наушников
    * Поиск "беспроводные наушники"
    * Ограничиваем цену до "10000"
    * Выбрать чекбокс "Samsung"
    * Выбрать чекбокс "JBL"
    * Выбрать чекбокс "Высокий рейтинг"
    * Добавляем в корзину первые "8" "четных" товаров
    * Переходим в корзину
    * Проверяем наличие товаров в соответствии с запомненным
    * Проверяем отображение текста Ваша корзина - "8" товаров
    * Удаляем все товары из корзины
    * Проверяем, что "Корзина пуста"
    * Добавляем шаг, в котором будет приложен файл с информацией

